app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "first_namelast_name", "email", "phone_number", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "password_digest", "provider", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "first_namelast_name" = $1, "image_updated_at" = $2, "image_file_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_namelast_name", "bar editing"], ["image_updated_at", "2015-06-13 20:56:59.180703"], ["image_file_name", "profile.png"], ["updated_at", "2015-06-13 20:56:59.435630"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)